app/controllers/announcements_controller.rb

INSERT INTO "announcements" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @announcement = Announcement.new(announcement_params)

    if @announcement.save

UPDATE "announcements" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "announcements"."id" = ?  [["title", "New Book Available"], ["description", "Buku sejarah peradaban telah ditambahkan ke perpustakaan"], ["updated_at", "2022-06-30 10:36:04.800031"], ["id", 1]]
---
  def update
    if @announcement.update(announcement_params)

SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_announcement
    @announcement = Announcement.find(params[:id])