app/controllers/announcement_categories_controller.rb

  def index
    @announcement_categories = AnnouncementCategory.all
---
SELECT "announcement_categories".* FROM "announcement_categories"

  def create
    @new_category = AnnouncementCategory.new(category_params)

    if @new_category.save
---
INSERT INTO "announcement_categories" ("category_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["category_name", "ekonomi"], ["created_at", "2022-06-30 10:40:50.985762"], ["updated_at", "2022-06-30 10:40:50.985762"]]

  def set_category_params
    @new_category = AnnouncementCategory.find(params[:id])
---
SELECT "announcement_categories".* FROM "announcement_categories" WHERE "announcement_categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]