app/controllers/buku_controller.rb

SELECT "bukus".* FROM "bukus"
---
  def index
    @bukus = Buku.all

INSERT INTO "bukus" ("category_id", "barcode", "isbn", "judul", "deskripsi", "penulis", "penerbit", "gambar_buku", "file_buku", "bahasa", "edisi", "tahun_terbit", "subject", "lokasi", "jumlah_buku", "is_available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    binding.break
    @buku = Buku.new(buku_params)
    if @buku.save

SELECT "bukus".* FROM "bukus" WHERE "bukus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bukus" SET "barcode" = ?, "isbn" = ?, "judul" = ?, "penulis" = ?, "edisi" = ?, "tahun_terbit" = ?, "jumlah_buku" = ?, "updated_at" = ? WHERE "bukus"."id" = ?
---
  def update
    @buku = Buku.find(params[:id])
    if @buku.update(buku_params)

DELETE FROM "bukus" WHERE "bukus"."id" = ?  [["id", 5]]
---
  def destroy
    @buku.destroy

SELECT "bukus".* FROM "bukus" WHERE "bukus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_buku
    @buku = Buku.find(params[:id])