app/controllers/categories_controller.rb

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "sosial"], ["updated_at", "2022-06-30 10:22:37.319034"], ["id", 4]]
---
  def update
    if @category.update(category_params)