app/controllers/search_controller.rb

  def search_title
    @bukus = Buku.search(search_params)
---
SELECT "bukus".* FROM "bukus" WHERE (judul LIKE '%3%')