app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("role_id", "profile", "name", "email", "username", "password_digest", "telephone", "birthday", "gender", "address", "is_active", "created_at", "updated_at", "confirmed_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)